app/controllers/histories_controller.rb

	def show
		@histories = History.where(user_id: current_user)
---
SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = 2

	def create
		# @history = "webwdlvrgvdfc"
		history = History.new(name: params[:history][:name], location: params[:history][:location])
		history.user = current_user
		history.save
---
INSERT INTO "histories" ("name", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["location", "Perth"], ["user_id", 1], ["created_at", "2017-07-27 12:34:37.271308"], ["updated_at", "2017-07-27 12:34:37.271308"]]